### 📋 Terraform Plan: `aws/dfbx/eu-south-2/resources/examples/single-module`

✅ **Plan Status:** Success
✅ **Format Check:** Passed

<details><summary>📄 Plan Output</summary>

```terraform
[0;90m01:56:02.834[0m [0;37mSTDOUT[0m [0;36mterraform: [0mdata.aws_caller_identity.current: Reading...
[0;90m01:56:02.835[0m [0;37mSTDOUT[0m [0;36mterraform: [0mdata.aws_partition.current: Reading...
[0;90m01:56:02.835[0m [0;37mSTDOUT[0m [0;36mterraform: [0mdata.aws_region.current: Reading...
[0;90m01:56:02.835[0m [0;37mSTDOUT[0m [0;36mterraform: [0mdata.aws_partition.current: Read complete after 0s [id=aws]
[0;90m01:56:02.835[0m [0;37mSTDOUT[0m [0;36mterraform: [0mdata.aws_region.current: Read complete after 0s [id=eu-south-2]
[0;90m01:56:02.835[0m [0;37mSTDOUT[0m [0;36mterraform: [0mdata.aws_caller_identity.current: Read complete after 0s [id=743199288519]
[0;90m01:56:02.835[0m [0;37mSTDOUT[0m [0;36mterraform: [0mTerraform used the selected providers to generate the following execution
[0;90m01:56:02.835[0m [0;37mSTDOUT[0m [0;36mterraform: [0mplan. Resource actions are indicated with the following symbols:
[0;90m01:56:02.835[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + create
[0;90m01:56:02.835[0m [0;37mSTDOUT[0m [0;36mterraform: [0mTerraform will perform the following actions:
[0;90m01:56:02.835[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_s3_bucket.this[0] will be created
[0;90m01:56:02.835[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_s3_bucket" "this" {
[0;90m01:56:02.835[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + acceleration_status         = (known after apply)
[0;90m01:56:02.835[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + acl                         = (known after apply)
[0;90m01:56:02.835[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + arn                         = (known after apply)
[0;90m01:56:02.835[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + bucket                      = "dfbx-example-bucket-eu-south-2"
[0;90m01:56:02.836[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + bucket_domain_name          = (known after apply)
[0;90m01:56:02.836[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + bucket_prefix               = (known after apply)
[0;90m01:56:02.836[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + bucket_region               = (known after apply)
[0;90m01:56:02.836[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + bucket_regional_domain_name = (known after apply)
[0;90m01:56:02.836[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + force_destroy               = false
[0;90m01:56:02.836[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + hosted_zone_id              = (known after apply)
[0;90m01:56:02.836[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id                          = (known after apply)
[0;90m01:56:02.836[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + object_lock_enabled         = false
[0;90m01:56:02.836[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + policy                      = (known after apply)
[0;90m01:56:02.836[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + region                      = "eu-south-2"
[0;90m01:56:02.836[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + request_payer               = (known after apply)
[0;90m01:56:02.836[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags                        = {
[0;90m01:56:02.836[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "created-by"  = "github-actions"
[0;90m01:56:02.836[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "environment" = "develop"
[0;90m01:56:02.836[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "name"        = "dfbx-example-bucket-eu-south-2"
[0;90m01:56:02.836[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "owner"       = "dfbx"
[0;90m01:56:02.837[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "repository"  = "https://github.com/darthfabax-org/iac"
[0;90m01:56:02.837[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m01:56:02.837[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags_all                    = {
[0;90m01:56:02.837[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "created-by"  = "github-actions"
[0;90m01:56:02.837[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "creator"     = "terragrunt"
[0;90m01:56:02.837[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "environment" = "develop"
[0;90m01:56:02.837[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "name"        = "dfbx-example-bucket-eu-south-2"
[0;90m01:56:02.837[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "owner"       = "dfbx"
[0;90m01:56:02.837[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "repository"  = "https://github.com/darthfabax-org/iac"
[0;90m01:56:02.837[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m01:56:02.837[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + website_domain              = (known after apply)
[0;90m01:56:02.837[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + website_endpoint            = (known after apply)
[0;90m01:56:02.837[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + cors_rule (known after apply)
[0;90m01:56:02.837[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + grant (known after apply)
[0;90m01:56:02.837[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + lifecycle_rule (known after apply)
[0;90m01:56:02.838[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + logging (known after apply)
[0;90m01:56:02.838[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + object_lock_configuration (known after apply)
[0;90m01:56:02.838[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + replication_configuration (known after apply)
[0;90m01:56:02.838[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + server_side_encryption_configuration (known after apply)
[0;90m01:56:02.838[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + versioning (known after apply)
[0;90m01:56:02.838[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + website (known after apply)
[0;90m01:56:02.838[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m01:56:02.838[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_s3_bucket_lifecycle_configuration.this[0] will be created
[0;90m01:56:02.838[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_s3_bucket_lifecycle_configuration" "this" {
[0;90m01:56:02.838[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + bucket                                 = (known after apply)
[0;90m01:56:02.838[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + expected_bucket_owner                  = (known after apply)
[0;90m01:56:02.838[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id                                     = (known after apply)
[0;90m01:56:02.838[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + region                                 = "eu-south-2"
[0;90m01:56:02.838[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + transition_default_minimum_object_size = "all_storage_classes_128K"
[0;90m01:56:02.838[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + rule {
[0;90m01:56:02.838[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + id     = "state"
[0;90m01:56:02.838[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + status = "Enabled"
[0;90m01:56:02.838[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            # (1 unchanged attribute hidden)
[0;90m01:56:02.839[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + filter {
[0;90m01:56:02.839[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                # (1 unchanged attribute hidden)
[0;90m01:56:02.839[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            }
[0;90m01:56:02.839[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + noncurrent_version_expiration {
[0;90m01:56:02.839[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + noncurrent_days = 90
[0;90m01:56:02.839[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            }
[0;90m01:56:02.839[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m01:56:02.839[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m01:56:02.839[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_s3_bucket_public_access_block.this[0] will be created
[0;90m01:56:02.839[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_s3_bucket_public_access_block" "this" {
[0;90m01:56:02.839[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + block_public_acls       = true
[0;90m01:56:02.839[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + block_public_policy     = true
[0;90m01:56:02.839[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + bucket                  = (known after apply)
[0;90m01:56:02.839[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id                      = (known after apply)
[0;90m01:56:02.839[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + ignore_public_acls      = true
[0;90m01:56:02.839[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + region                  = "eu-south-2"
[0;90m01:56:02.839[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + restrict_public_buckets = true
[0;90m01:56:02.839[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + skip_destroy            = true
[0;90m01:56:02.839[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m01:56:02.839[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_s3_bucket_server_side_encryption_configuration.this[0] will be created
[0;90m01:56:02.839[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_s3_bucket_server_side_encryption_configuration" "this" {
[0;90m01:56:02.839[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + bucket = (known after apply)
[0;90m01:56:02.839[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id     = (known after apply)
[0;90m01:56:02.840[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + region = "eu-south-2"
[0;90m01:56:02.840[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + rule {
[0;90m01:56:02.840[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + blocked_encryption_types = []
[0;90m01:56:02.840[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + apply_server_side_encryption_by_default {
[0;90m01:56:02.840[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + sse_algorithm     = "AES256"
[0;90m01:56:02.840[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                # (1 unchanged attribute hidden)
[0;90m01:56:02.840[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            }
[0;90m01:56:02.840[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m01:56:02.840[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m01:56:02.840[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_s3_bucket_versioning.this[0] will be created
[0;90m01:56:02.840[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_s3_bucket_versioning" "this" {
[0;90m01:56:02.840[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + bucket = (known after apply)
[0;90m01:56:02.840[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id     = (known after apply)
[0;90m01:56:02.840[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + region = "eu-south-2"
[0;90m01:56:02.840[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + versioning_configuration {
[0;90m01:56:02.840[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + mfa_delete = (known after apply)
[0;90m01:56:02.840[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + status     = "Enabled"
[0;90m01:56:02.840[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m01:56:02.840[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m01:56:02.840[0m [0;37mSTDOUT[0m [0;36mterraform: [0mPlan: 5 to add, 0 to change, 0 to destroy.
[0;90m01:56:02.840[0m [0;37mSTDOUT[0m [0;36mterraform: [0mChanges to Outputs:
[0;90m01:56:02.840[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + aws_s3_bucket_versioning_status         = "Enabled"
[0;90m01:56:02.840[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + s3_bucket_arn                           = (known after apply)
[0;90m01:56:02.840[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + s3_bucket_bucket_domain_name            = (known after apply)
[0;90m01:56:02.840[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + s3_bucket_bucket_regional_domain_name   = (known after apply)
[0;90m01:56:02.841[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + s3_bucket_hosted_zone_id                = (known after apply)
[0;90m01:56:02.841[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + s3_bucket_id                            = (known after apply)
[0;90m01:56:02.841[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + s3_bucket_lifecycle_configuration_rules = [
[0;90m01:56:02.841[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + {
[0;90m01:56:02.841[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + abort_incomplete_multipart_upload = []
[0;90m01:56:02.841[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + expiration                        = []
[0;90m01:56:02.841[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + filter                            = [
[0;90m01:56:02.841[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + {
[0;90m01:56:02.841[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                  + and                      = []
[0;90m01:56:02.841[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                  + object_size_greater_than = null
[0;90m01:56:02.841[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                  + object_size_less_than    = null
[0;90m01:56:02.841[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                  + prefix                   = ""
[0;90m01:56:02.841[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                  + tag                      = []
[0;90m01:56:02.841[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                },
[0;90m01:56:02.841[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            ]
[0;90m01:56:02.841[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + id                                = "state"
[0;90m01:56:02.841[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + noncurrent_version_expiration     = [
[0;90m01:56:02.841[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + {
[0;90m01:56:02.841[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                  + newer_noncurrent_versions = null
[0;90m01:56:02.841[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                  + noncurrent_days           = 90
[0;90m01:56:02.842[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                },
[0;90m01:56:02.842[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            ]
[0;90m01:56:02.842[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + noncurrent_version_transition     = []
[0;90m01:56:02.842[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + prefix                            = ""
[0;90m01:56:02.842[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + status                            = "Enabled"
[0;90m01:56:02.842[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + transition                        = []
[0;90m01:56:02.842[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        },
[0;90m01:56:02.842[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    ]
[0;90m01:56:02.842[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + s3_bucket_policy                        = ""
[0;90m01:56:02.842[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + s3_bucket_region                        = (known after apply)
[0;90m01:56:02.842[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + s3_bucket_tags                          = {
[0;90m01:56:02.842[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + created-by  = "github-actions"
[0;90m01:56:02.842[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + environment = "develop"
[0;90m01:56:02.842[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + name        = "dfbx-example-bucket-eu-south-2"
[0;90m01:56:02.842[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + owner       = "dfbx"
[0;90m01:56:02.842[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + repository  = "https://github.com/darthfabax-org/iac"
[0;90m01:56:02.842[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m01:56:02.842[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + s3_bucket_website_domain                = ""
[0;90m01:56:02.842[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + s3_bucket_website_endpoint              = ""
[0;90m01:56:02.842[0m [0;37mSTDOUT[0m [0;36mterraform: [0m─────────────────────────────────────────────────────────────────────────────
[0;90m01:56:02.843[0m [0;37mSTDOUT[0m [0;36mterraform: [0mNote: You didn't use the -out option to save this plan, so Terraform can't
[0;90m01:56:02.843[0m [0;37mSTDOUT[0m [0;36mterraform: [0mguarantee to take exactly these actions if you run "terraform apply" now.

```
</details>

---
*Workflow: [Terragrunt Plan/Apply IaC](https://github.com/darthfabax-org/iac/actions/runs/22289975118)*